branches/posix/test/test-ws-handlers/docs/handler-test-results/co-ok-si-ts.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |                        |             X             |
|----------|--------------|------------------------|---------------------------|
|Client IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|


Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@8420ae> (constructor)
                    handler.server.HandlerBoston@7db937> (constructor)
                    handler.server.HandlerChicago@b049a> (constructor)
                    handler.server.HandlerDenver@15b28d8> (constructor)
                    handler.server.HandlerEasy@1d688e2> (constructor)
                    2/Mai/2008 17:58:09 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing


Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@fefe3f> (constructor)
handler.client.HandlerBravo@c2b2f6> (constructor)
handler.client.HandlerCharlie@1a001ff> (constructor)
handler.client.HandlerDelta@90c06f> (constructor)
handler.client.HandlerEcho@1267649> (constructor)
handler.client.HandlerAlpha@fefe3f> getHeaders()
handler.client.HandlerBravo@c2b2f6> getHeaders()
handler.client.HandlerCharlie@1a001ff> getHeaders()
handler.client.HandlerDelta@90c06f> getHeaders()
handler.client.HandlerEcho@1267649> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@fefe3f> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@1267649> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@8420ae> getHeaders()
                    handler.server.HandlerBoston@7db937> getHeaders()
                    handler.server.HandlerChicago@b049a> getHeaders()
                    handler.server.HandlerDenver@15b28d8> getHeaders()
                    handler.server.HandlerEasy@1d688e2> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@1d688e2> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@15b28d8> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@b049a> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@b049a throwing soap fault exception
                    handler.server.HandlerDenver@15b28d8> handleFault() - Inbound SOAP message
                    handler.server.HandlerEasy@1d688e2> handleFault() - Inbound SOAP message
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:ns1="http://hello" xmlns:xsd="http://www.w3.org/2001/XML
                    Schema"><soapenv:Body><soapenv:Fault><faultcode xmlns:SOAP-ENV="http://schemas.x
                    mlsoap.org/soap/envelope/">SOAP-ENV:Server</faultcode><faultstring>Server Inboun
                    d - SOAP Fault!</faultstring><faultactor></faultactor></soapenv:Fault></soapenv:
                    Body></soapenv:Envelope>
                    handler.server.HandlerEasy@1d688e2> close()
                    handler.server.HandlerDenver@15b28d8> close()
                    handler.server.HandlerChicago@b049a> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://hello" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soapenv:Body><soapenv:Fault><faultcode xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">SOAP-ENV:Server</faultcode><faultstring>Server Inbound - SOAP Fault!</faultstring><faultactor></faultactor></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Inbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Inbound SOAP message
handler.client.HandlerAlpha@fefe3f> handleMessage() - Inbound SOAP message
Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://hello" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soapenv:Body><soapenv:Fault><faultcode xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">SOAP-ENV:Server</faultcode><faultstring>Server Inbound - SOAP Fault!</faultstring><faultactor></faultactor></soapenv:Fault></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> close()
handler.client.HandlerDelta@90c06f> close()
handler.client.HandlerCharlie@1a001ff> close()
handler.client.HandlerBravo@c2b2f6> close()
handler.client.HandlerAlpha@fefe3f> close()
Exception in thread "main" javax.xml.ws.soap.SOAPFaultException: Server Inbound - SOAP Fault!
	at com.sun.xml.ws.encoding.soap.ClientEncoderDecoder.toMessageInfo(ClientEncoderDecoder.java:80)
	at com.sun.xml.ws.encoding.soap.client.SOAPXMLDecoder.toMessageInfo(SOAPXMLDecoder.java:200)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.receive(SOAPMessageDispatcher.java:549)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.doSend(SOAPMessageDispatcher.java:288)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.send(SOAPMessageDispatcher.java:153)
	at com.sun.xml.ws.encoding.soap.internal.DelegateBase.send(DelegateBase.java:85)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.implementSEIMethod(EndpointIFInvocationHandler.java:176)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.invoke(EndpointIFInvocationHandler.java:105)
	at $Proxy18.sayHello(Unknown Source)
	at hello.HelloServiceClient.main(HelloServiceClient.java:10)
